ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_rst_clk.h
#define IS_RST_CLK_CPU_PLL_MUL(SRC)     ((SRC) <= 0x0F)

/**
  * @brief RST_CLK USB_PLL clock mode and source selection constants
  */
typedef enum
{
    RST_CLK_USB_PLLsrcHSIdiv1 = ((uint32_t)0x00), /*!< HSI oscillator clock is selected as USB_PLL clock entry. */
    RST_CLK_USB_PLLsrcHSIdiv2 = ((uint32_t)0x01), /*!< HSI oscillator clock divided by 2 is selected as USB_PLL clock entry. */
    RST_CLK_USB_PLLsrcHSEdiv1 = ((uint32_t)0x02), /*!< HSE oscillator clock is selected as USB_PLL clock entry. */
    RST_CLK_USB_PLLsrcHSEdiv2 = ((uint32_t)0x03)  /*!< HSE oscillator clock divided by 2 is selected as USB_PLL clock entry. */
} RST_CLK_USB_PLL_Source;

#define IS_RST_CLK_USB_PLL_SOURCE(SRC)  (((SRC) == RST_CLK_USB_PLLsrcHSIdiv1) ||\
                                         ((SRC) == RST_CLK_USB_PLLsrcHSIdiv2) ||\
                                         ((SRC) == RST_CLK_USB_PLLsrcHSEdiv1) ||\
                                         ((SRC) == RST_CLK_USB_PLLsrcHSEdiv2))

/**
  * @brief RST_CLK USB_C1 clock PLL_USB_MUL multiplier constants
  */
typedef enum
{
    RST_CLK_USB_PLLmul1  = ((uint32_t)0x00),
    RST_CLK_USB_PLLmul2  = ((uint32_t)0x01),
    RST_CLK_USB_PLLmul3  = ((uint32_t)0x02),
    RST_CLK_USB_PLLmul4  = ((uint32_t)0x03),
    RST_CLK_USB_PLLmul5  = ((uint32_t)0x04),
    RST_CLK_USB_PLLmul6  = ((uint32_t)0x05),
    RST_CLK_USB_PLLmul7  = ((uint32_t)0x06),
    RST_CLK_USB_PLLmul8  = ((uint32_t)0x07),
    RST_CLK_USB_PLLmul9  = ((uint32_t)0x08),
    RST_CLK_USB_PLLmul10 = ((uint32_t)0x09),
    RST_CLK_USB_PLLmul11 = ((uint32_t)0x0A),
    RST_CLK_USB_PLLmul12 = ((uint32_t)0x0B),
    RST_CLK_USB_PLLmul13 = ((uint32_t)0x0C),
    RST_CLK_USB_PLLmul14 = ((uint32_t)0x0D),
    RST_CLK_USB_PLLmul15 = ((uint32_t)0x0E),
    RST_CLK_USB_PLLmul16 = ((uint32_t)0x0F)
} RST_CLK_USB_PLL_Multiplier;

#define IS_RST_CLK_USB_PLL_MUL(SRC)     ((SRC) <= 0x0F)

/**
  * @brief RST_CLK CPU_PLL output clock CPU_CLK_DIV divider constants
  */
typedef enum
{
    RST_CLK_CPUclkDIV1   = ((uint32_t)0x00),
    RST_CLK_CPUclkDIV2   = ((uint32_t)0x08),
    RST_CLK_CPUclkDIV4   = ((uint32_t)0x09),
    RST_CLK_CPUclkDIV8   = ((uint32_t)0x0A),
    RST_CLK_CPUclkDIV16  = ((uint32_t)0x0B),
    RST_CLK_CPUclkDIV32  = ((uint32_t)0x0C),
    RST_CLK_CPUclkDIV64  = ((uint32_t)0x0D),
    RST_CLK_CPUclkDIV128 = ((uint32_t)0x0E),
    RST_CLK_CPUclkDIV256 = ((uint32_t)0x0F)
} RST_CLK_CPU_C3_Divisor;

#define IS_RST_CLK_CPUclkDIV(DIV)   (((DIV) == RST_CLK_CPUclkDIV1)   || \
                                     ((DIV) == RST_CLK_CPUclkDIV2)   || \
                                     ((DIV) == RST_CLK_CPUclkDIV4)   || \
                                     ((DIV) == RST_CLK_CPUclkDIV8)   || \
                                     ((DIV) == RST_CLK_CPUclkDIV16)  || \
                                     ((DIV) == RST_CLK_CPUclkDIV32)  || \
                                     ((DIV) == RST_CLK_CPUclkDIV64)  || \
                                     ((DIV) == RST_CLK_CPUclkDIV128) || \
                                     ((DIV) == RST_CLK_CPUclkDIV256))

/**
  * @brief RST_CLK CPU_CLK source CPU_CLK selector constants
  */
typedef enum
{
    RST_CLK_CPUclkHSI    = ((uint32_t)0x0000),
    RST_CLK_CPUclkCPU_C3 = ((uint32_t)0x0100),
    RST_CLK_CPUclkLSE    = ((uint32_t)0x0200),
    RST_CLK_CPUclkLSI    = ((uint32_t)0x0300)
} RST_CLK_HCLK_Source;

#define IS_RST_CPU_CLK(SRC)     (((SRC) == RST_CLK_CPUclkHSI)    || \
                                 ((SRC) == RST_CLK_CPUclkCPU_C3) || \
                                 ((SRC) == RST_CLK_CPUclkLSE)    || \
                                 ((SRC) == RST_CLK_CPUclkLSI))

/**
  * @brief RST_CLK ADC_CLK selector constants
  */
typedef enum
{
    RST_CLK_ADCclkCPU_C1 = ((uint32_t)0x0020),
    RST_CLK_ADCclkUSB_C1 = ((uint32_t)0x0021),
    RST_CLK_ADCclkCPU_C2 = ((uint32_t)0x0022),
    RST_CLK_ADCclkUSB_C2 = ((uint32_t)0x0023),
    RST_CLK_ADCclkLSE    = ((uint32_t)0x0000),
    RST_CLK_ADCclkLSI    = ((uint32_t)0x0010),
    RST_CLK_ADCclkHSI_C1 = ((uint32_t)0x0030)
} RST_CLK_ADC_Source;

#define IS_RST_CLK_ADCclk(SRC)  (((SRC) == RST_CLK_ADCclkCPU_C1) || \
                                 ((SRC) == RST_CLK_ADCclkUSB_C1) || \
                                 ((SRC) == RST_CLK_ADCclkCPU_C2) || \
                                 ((SRC) == RST_CLK_ADCclkUSB_C2) || \
                                 ((SRC) == RST_CLK_ADCclkLSE)    || \
                                 ((SRC) == RST_CLK_ADCclkLSI)    || \
                                 ((SRC) == RST_CLK_ADCclkHSI_C1))

/**
  * @brief RST_CLK ADC_CS2_SEL output clock ADC_CS3_SEL divider constants
  */
typedef enum
{
    RST_CLK_ADCclkDIV1   = ((uint32_t)0x00),
    RST_CLK_ADCclkDIV2   = ((uint32_t)0x08),
    RST_CLK_ADCclkDIV4   = ((uint32_t)0x09),
    RST_CLK_ADCclkDIV8   = ((uint32_t)0x0A),
    RST_CLK_ADCclkDIV16  = ((uint32_t)0x0B),
    RST_CLK_ADCclkDIV32  = ((uint32_t)0x0C),
    RST_CLK_ADCclkDIV64  = ((uint32_t)0x0D),
    RST_CLK_ADCclkDIV128 = ((uint32_t)0x0E),
    RST_CLK_ADCclkDIV256 = ((uint32_t)0x0F)
} RST_CLK_ADC_C3_Divisor;

#define IS_RST_CLK_ADCclkDivValue(SRC)  (((SRC) == RST_CLK_ADCclkDIV1)   || \
                                         ((SRC) == RST_CLK_ADCclkDIV2)   || \
                                         ((SRC) == RST_CLK_ADCclkDIV4)   || \
                                         ((SRC) == RST_CLK_ADCclkDIV8)   || \
                                         ((SRC) == RST_CLK_ADCclkDIV16)  || \
                                         ((SRC) == RST_CLK_ADCclkDIV32)  || \
                                         ((SRC) == RST_CLK_ADCclkDIV64)  || \
                                         ((SRC) == RST_CLK_ADCclkDIV128) || \
                                         ((SRC) == RST_CLK_ADCclkDIV256))

#if defined (USE_MDR32FG16S1QI)
/**
 * @brief RST_CLK AUC_CLK selector constants
 */
typedef enum
{
    RST_CLK_AUCclkHSI_C1   = ((uint32_t)0x00000000),
    RST_CLK_AUCclkHSI_2_C1 = ((uint32_t)0x00010000),
    RST_CLK_AUCclkHSE_C1   = ((uint32_t)0x00020000),
    RST_CLK_AUCclkHSE_2_C1 = ((uint32_t)0x00030000),
    RST_CLK_AUCclkPLLCPU   = ((uint32_t)0x00100000),
    RST_CLK_AUCclkPLLUSB   = ((uint32_t)0x00200000)
} RST_CLK_AUC_Source;

#define IS_RST_CLK_AUCclk(SRC)  (((SRC) == RST_CLK_AUCclkHSI_C1)   || \
                                 ((SRC) == RST_CLK_AUCclkHSI_2_C1) || \
                                 ((SRC) == RST_CLK_AUCclkHSE_C1)   || \
                                 ((SRC) == RST_CLK_AUCclkHSE_2_C1) || \
                                 ((SRC) == RST_CLK_AUCclkPLLCPU)   || \
                                 ((SRC) == RST_CLK_AUCclkPLLUSB))

 /**
  * @brief AUC_MCO_CLK AUC_CLK output clock AUC_CLK_DIV divider
  */
typedef enum
{
    RST_CLK_AUCclkDIV1   = ((uint32_t)0x00000000),
    RST_CLK_AUCclkDIV2   = ((uint32_t)0x08000000 | 0x00000000),
    RST_CLK_AUCclkDIV4   = ((uint32_t)0x08000000 | 0x01000000),
    RST_CLK_AUCclkDIV8   = ((uint32_t)0x08000000 | 0x02000000),
    RST_CLK_AUCclkDIV16  = ((uint32_t)0x08000000 | 0x03000000),
    RST_CLK_AUCclkDIV32  = ((uint32_t)0x08000000 | 0x04000000),
    RST_CLK_AUCclkDIV64  = ((uint32_t)0x08000000 | 0x05000000),
    RST_CLK_AUCclkDIV128 = ((uint32_t)0x08000000 | 0x06000000),
    RST_CLK_AUCclkDIV256 = ((uint32_t)0x08000000 | 0x07000000)
} RST_CLK_AUC_C3_Divisor;

#define IS_RST_CLK_AUCclkDIV(DIV)   (((DIV) == RST_CLK_AUCclkDIV1)   || \
                                     ((DIV) == RST_CLK_AUCclkDIV2)   || \
                                     ((DIV) == RST_CLK_AUCclkDIV4)   || \
                                     ((DIV) == RST_CLK_AUCclkDIV8)   || \
                                     ((DIV) == RST_CLK_AUCclkDIV16)  || \
                                     ((DIV) == RST_CLK_AUCclkDIV32)  || \
                                     ((DIV) == RST_CLK_AUCclkDIV64)  || \
                                     ((DIV) == RST_CLK_AUCclkDIV128) || \
                                     ((DIV) == RST_CLK_AUCclkDIV256))
#endif /* #if defined (USE_MDR32FG16S1QI) */

/**
  * @brief RST_CLK flag identifiers
  */
typedef enum
{
    RST_CLK_FLAG_HSIRDY    = ((uint32_t)(0x00 | 23)),
    RST_CLK_FLAG_LSIRDY    = ((uint32_t)(0x00 | 21)),
    RST_CLK_FLAG_HSERDY    = ((uint32_t)(0x20 |  2)),
    RST_CLK_FLAG_HSE2RDY   = ((uint32_t)(0x20 |  3)),
    RST_CLK_FLAG_LSERDY    = ((uint32_t)(0x00 | 13)),
    RST_CLK_FLAG_PLLCPURDY = ((uint32_t)(0x20 |  1)),
    RST_CLK_FLAG_PLLUSBRDY = ((uint32_t)(0x20 |  0)),
    RST_CLK_FLAG_PLLDSPRDY = ((uint32_t)(0x20 |  3))
} RST_CLK_Flags;

#define IS_RST_CLK_FLAG(FLAG)   (((FLAG) == RST_CLK_FLAG_HSIRDY)    || \
                                 ((FLAG) == RST_CLK_FLAG_LSIRDY)    || \
                                 ((FLAG) == RST_CLK_FLAG_HSERDY)    || \
                                 ((FLAG) == RST_CLK_FLAG_HSE2RDY)   || \
                                 ((FLAG) == RST_CLK_FLAG_PLLDSPRDY) || \
                                 ((FLAG) == RST_CLK_FLAG_LSERDY)    || \
                                 ((FLAG) == RST_CLK_FLAG_PLLCPURDY) || \
                                 ((FLAG) == RST_CLK_FLAG_PLLUSBRDY))

/**
  * @brief RST_CLK HSI clock HSI_C1_SEL divider constants
  */
typedef enum
{
    RST_CLK_HSIclkDIV1   = ((uint32_t)0x00),
    RST_CLK_HSIclkDIV2   = ((uint32_t)0x08),
    RST_CLK_HSIclkDIV4   = ((uint32_t)0x09),
    RST_CLK_HSIclkDIV8   = ((uint32_t)0x0A),
    RST_CLK_HSIclkDIV16  = ((uint32_t)0x0B),
    RST_CLK_HSIclkDIV32  = ((uint32_t)0x0C),
    RST_CLK_HSIclkDIV64  = ((uint32_t)0x0D),
    RST_CLK_HSIclkDIV128 = ((uint32_t)0x0E),
    RST_CLK_HSIclkDIV256 = ((uint32_t)0x0F)
} RST_CLK_HSI_C1_Divisor;

