ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_rst_clk.h
#define IS_RST_CLK_HSIclkDivValue(SRC)  (((SRC) == RST_CLK_HSIclkDIV1)   || \
                                         ((SRC) == RST_CLK_HSIclkDIV2)   || \
                                         ((SRC) == RST_CLK_HSIclkDIV4)   || \
                                         ((SRC) == RST_CLK_HSIclkDIV8)   || \
                                         ((SRC) == RST_CLK_HSIclkDIV16)  || \
                                         ((SRC) == RST_CLK_HSIclkDIV32)  || \
                                         ((SRC) == RST_CLK_HSIclkDIV64)  || \
                                         ((SRC) == RST_CLK_HSIclkDIV128) || \
                                         ((SRC) == RST_CLK_HSIclkDIV256))

/**
  * @brief RST_CLK HSE clock HSE_C1_SEL divider constants
  */
typedef enum
{
    RST_CLK_HSEclkDIV1   = ((uint32_t)0x00),
    RST_CLK_HSEclkDIV2   = ((uint32_t)0x08),
    RST_CLK_HSEclkDIV4   = ((uint32_t)0x09),
    RST_CLK_HSEclkDIV8   = ((uint32_t)0x0A),
    RST_CLK_HSEclkDIV16  = ((uint32_t)0x0B),
    RST_CLK_HSEclkDIV32  = ((uint32_t)0x0C),
    RST_CLK_HSEclkDIV64  = ((uint32_t)0x0D),
    RST_CLK_HSEclkDIV128 = ((uint32_t)0x0E),
    RST_CLK_HSEclkDIV256 = ((uint32_t)0x0F)
} RST_CLK_HSE_C1_Divisor;

#define IS_RST_CLK_HSEclkDivValue(SRC)  (((SRC) == RST_CLK_HSEclkDIV1)   || \
                                         ((SRC) == RST_CLK_HSEclkDIV2)   || \
                                         ((SRC) == RST_CLK_HSEclkDIV4)   || \
                                         ((SRC) == RST_CLK_HSEclkDIV8)   || \
                                         ((SRC) == RST_CLK_HSEclkDIV16)  || \
                                         ((SRC) == RST_CLK_HSEclkDIV32)  || \
                                         ((SRC) == RST_CLK_HSEclkDIV64)  || \
                                         ((SRC) == RST_CLK_HSEclkDIV128) || \
                                         ((SRC) == RST_CLK_HSEclkDIV256))

#if defined (USE_MDR32FG16S1QI)
/**
  * @brief RST_CLK DSP C1 clock source constants
  */
typedef enum
{
    DSP_C1_CLOCK_HSI  = (uint32_t)(0x00),
    DSP_C1_CLOCK_HSI2 = (uint32_t)(0x01),
    DSP_C1_CLOCK_HSE  = (uint32_t)(0x02),
    DSP_C1_CLOCK_HSE2 = (uint32_t)(0x03)
} RST_CLK_DSP_C1_Source;

#define IS_DSP_C1_CLOCK(CLOCK)  (((CLOCK) == DSP_C1_CLOCK_HSI)  || \
                                 ((CLOCK) == DSP_C1_CLOCK_HSI2) || \
                                 ((CLOCK) == DSP_C1_CLOCK_HSE)  || \
                                 ((CLOCK) == DSP_C1_CLOCK_HSE2))

/**
  * @brief RST_CLK DSP PLL clock DSP_PLL_MUL multiplier constants
  */
typedef enum
{
    DSP_PLL_MUL1  = (uint32_t)(0x00),
    DSP_PLL_MUL2  = (uint32_t)(0x01),
    DSP_PLL_MUL3  = (uint32_t)(0x02),
    DSP_PLL_MUL4  = (uint32_t)(0x03),
    DSP_PLL_MUL5  = (uint32_t)(0x04),
    DSP_PLL_MUL6  = (uint32_t)(0x05),
    DSP_PLL_MUL7  = (uint32_t)(0x06),
    DSP_PLL_MUL8  = (uint32_t)(0x07),
    DSP_PLL_MUL9  = (uint32_t)(0x08),
    DSP_PLL_MUL10 = (uint32_t)(0x09),
    DSP_PLL_MUL11 = (uint32_t)(0x0A),
    DSP_PLL_MUL12 = (uint32_t)(0x0B),
    DSP_PLL_MUL13 = (uint32_t)(0x0C),
    DSP_PLL_MUL14 = (uint32_t)(0x0D),
    DSP_PLL_MUL15 = (uint32_t)(0x0E),
    DSP_PLL_MUL16 = (uint32_t)(0x0F)
} RST_CLK_DSP_PLL_Multiplier;

#define IS_DSP_PLL_MULL(PLL_MUL)    ((PLL_MUL) <= 0x0F)

/**
  * @brief RST_CLK DSP clock DSP_C3_SEL divider constants
  */
typedef enum
{
    DSP_PRESCALER1 = (uint32_t)(0x00),
    DSP_PRESCALER2 = (uint32_t)(0x01)
} RST_CLK_DSP_C3_Divisor;

#define IS_DSP_PRESCALER(PRESCALER)     (((PRESCALER) == DSP_PRESCALER1) || \
                                         ((PRESCALER) == DSP_PRESCALER2))
#endif /* #if defined (USE_MDR32FG16S1QI) */

/** @} */ /* End of group RST_CLK_Exported_Types */


/** @defgroup RST_CLK_Exported_Constants RST_CLK Exported Constants
  * @{
  */

/** @defgroup CLK_peripheral CLK peripheral
  * @{
  */

/**
  * @brief RST_CLK peripheral modules clock constants
  */

#define PCLK_BIT(BASE)                  ((uint32_t)(1U << ((((uint32_t)BASE) >> 15) & 0x1F)))

#if defined (USE_MDR32F9Q2I)

    #define RST_CLK_PCLK_CAN1           PCLK_BIT(MDR_CAN1_BASE)
    #define RST_CLK_PCLK_CAN2           PCLK_BIT(MDR_CAN2_BASE)
    #define RST_CLK_PCLK_USB            PCLK_BIT(MDR_USB_BASE)
    #define RST_CLK_PCLK_EEPROM         PCLK_BIT(MDR_EEPROM_BASE)
    #define RST_CLK_PCLK_RST_CLK        PCLK_BIT(MDR_RST_CLK_BASE)
    #define RST_CLK_PCLK_DMA            PCLK_BIT(MDR_DMA_BASE)
    #define RST_CLK_PCLK_UART1          PCLK_BIT(MDR_UART1_BASE)
    #define RST_CLK_PCLK_UART2          PCLK_BIT(MDR_UART2_BASE)
    #define RST_CLK_PCLK_SSP1           PCLK_BIT(MDR_SSP1_BASE)
    #define RST_CLK_PCLK_09             PCLK_BIT(0x40048000)
    #define RST_CLK_PCLK_I2C            PCLK_BIT(MDR_I2C_BASE)
    #define RST_CLK_PCLK_POWER          PCLK_BIT(MDR_POWER_BASE)
    #define RST_CLK_PCLK_WWDG           PCLK_BIT(MDR_WWDG_BASE)
    #define RST_CLK_PCLK_IWDG           PCLK_BIT(MDR_IWDG_BASE)
    #define RST_CLK_PCLK_TIMER1         PCLK_BIT(MDR_TIMER1_BASE)
    #define RST_CLK_PCLK_TIMER2         PCLK_BIT(MDR_TIMER2_BASE)
    #define RST_CLK_PCLK_TIMER3         PCLK_BIT(MDR_TIMER3_BASE)
    #define RST_CLK_PCLK_ADC            PCLK_BIT(MDR_ADC_BASE)
    #define RST_CLK_PCLK_DAC            PCLK_BIT(MDR_DAC_BASE)
    #define RST_CLK_PCLK_COMP           PCLK_BIT(MDR_COMP_BASE)
    #define RST_CLK_PCLK_SSP2           PCLK_BIT(MDR_SSP2_BASE)
    #define RST_CLK_PCLK_PORTA          PCLK_BIT(MDR_PORTA_BASE)
    #define RST_CLK_PCLK_PORTB          PCLK_BIT(MDR_PORTB_BASE)
    #define RST_CLK_PCLK_PORTC          PCLK_BIT(MDR_PORTC_BASE)
    #define RST_CLK_PCLK_PORTD          PCLK_BIT(MDR_PORTD_BASE)
    #define RST_CLK_PCLK_PORTE          PCLK_BIT(MDR_PORTE_BASE)
    #define RST_CLK_PCLK_26             PCLK_BIT(0x400D0000)
    #define RST_CLK_PCLK_BKP            PCLK_BIT(MDR_BKP_BASE)
    #define RST_CLK_PCLK_28             PCLK_BIT(0x400E0000)
    #define RST_CLK_PCLK_PORTF          PCLK_BIT(MDR_PORTF_BASE)
    #define RST_CLK_PCLK_EBC            PCLK_BIT(MDR_EBC_BASE)
    #define RST_CLK_PCLK_31             PCLK_BIT(0x400F8000)


    #define IS_RST_CLK_PCLK(PCLK)       ((((PCLK) & RST_CLK_PCLK_09) == 0x00) && \
                                         (((PCLK) & RST_CLK_PCLK_26) == 0x00) && \
                                         (((PCLK) & RST_CLK_PCLK_28) == 0x00) && \
                                         (((PCLK) & RST_CLK_PCLK_31) == 0x00))
#endif /* #if defined (USE_MDR32F9Q2I) */

#if defined (USE_MDR32FG16S1QI)

    #define RST_CLK_PCLK_SSP3           PCLK_BIT(MDR_SSP3_BASE)
    #define RST_CLK_PCLK_SSP4           PCLK_BIT(MDR_SSP4_BASE)
    #define RST_CLK_PCLK_USB            PCLK_BIT(MDR_USB_BASE)
    #define RST_CLK_PCLK_EEPROM         PCLK_BIT(MDR_EEPROM_BASE)
    #define RST_CLK_PCLK_RST_CLK        PCLK_BIT(MDR_RST_CLK_BASE)
    #define RST_CLK_PCLK_DMA            PCLK_BIT(MDR_DMA_BASE)
    #define RST_CLK_PCLK_UART1          PCLK_BIT(MDR_UART1_BASE)
    #define RST_CLK_PCLK_UART2          PCLK_BIT(MDR_UART2_BASE)
    #define RST_CLK_PCLK_SSP1           PCLK_BIT(MDR_SSP1_BASE)
    #define RST_CLK_PCLK_SDIO           PCLK_BIT(MDR_SDIO_BASE)
    #define RST_CLK_PCLK_I2C            PCLK_BIT(MDR_I2C_BASE)
    #define RST_CLK_PCLK_POWER          PCLK_BIT(MDR_POWER_BASE)
    #define RST_CLK_PCLK_WWDG           PCLK_BIT(MDR_WWDG_BASE)
    #define RST_CLK_PCLK_IWDG           PCLK_BIT(MDR_IWDG_BASE)
    #define RST_CLK_PCLK_TIMER1         PCLK_BIT(MDR_TIMER1_BASE)
    #define RST_CLK_PCLK_TIMER2         PCLK_BIT(MDR_TIMER2_BASE)
    #define RST_CLK_PCLK_TIMER3         PCLK_BIT(MDR_TIMER3_BASE)
    #define RST_CLK_PCLK_ADC            PCLK_BIT(MDR_ADC_BASE)
    #define RST_CLK_PCLK_DAC            PCLK_BIT(MDR_DAC_BASE)
    #define RST_CLK_PCLK_COMP           PCLK_BIT(MDR_COMP_BASE)
    #define RST_CLK_PCLK_SSP2           PCLK_BIT(MDR_SSP2_BASE)
    #define RST_CLK_PCLK_PORTA          PCLK_BIT(MDR_PORTA_BASE)
    #define RST_CLK_PCLK_PORTB          PCLK_BIT(MDR_PORTB_BASE)
    #define RST_CLK_PCLK_PORTC          PCLK_BIT(MDR_PORTC_BASE)
    #define RST_CLK_PCLK_PORTD          PCLK_BIT(MDR_PORTD_BASE)
    #define RST_CLK_PCLK_PORTE          PCLK_BIT(MDR_PORTE_BASE)
    #define RST_CLK_PCLK_UART3          PCLK_BIT(MDR_UART3_BASE)
    #define RST_CLK_PCLK_BKP            PCLK_BIT(MDR_BKP_BASE)
    #define RST_CLK_PCLK_AUDIO_IP       ((uint32_t)0x10000000)
    #define RST_CLK_PCLK_PORTF          PCLK_BIT(MDR_PORTF_BASE)
    #define RST_CLK_PCLK_EBC            PCLK_BIT(MDR_EBC_BASE)
    #define RST_CLK_PCLK_31             PCLK_BIT(0x400F8000)


