ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_rst_clk.h
    #define IS_RST_CLK_PCLK(PCLK)       (((PCLK) & RST_CLK_PCLK_31) == 0x00)
#endif /* #if defined (USE_MDR32FG16S1QI) */


#if defined (USE_MDR32F1QI)
    #define RST_CLK_PCLK_CAN1           PCLK_BIT(MDR_CAN1_BASE)
    #define RST_CLK_PCLK_CAN2           PCLK_BIT(MDR_CAN2_BASE)
    #define RST_CLK_PCLK_USB            PCLK_BIT(MDR_USB_BASE)
    #define RST_CLK_PCLK_EEPROM         PCLK_BIT(MDR_EEPROM_BASE)
    #define RST_CLK_PCLK_RST_CLK        PCLK_BIT(MDR_RST_CLK_BASE)
    #define RST_CLK_PCLK_DMA            PCLK_BIT(MDR_DMA_BASE)
    #define RST_CLK_PCLK_UART1          PCLK_BIT(MDR_UART1_BASE)
    #define RST_CLK_PCLK_UART2          PCLK_BIT(MDR_UART2_BASE)
    #define RST_CLK_PCLK_SSP1           PCLK_BIT(MDR_SSP1_BASE)
    #define RST_CLK_PCLK_MIL_STD_15531  PCLK_BIT(MDR_MIL_STD_15531_BASE)
    #define RST_CLK_PCLK_MIL_STD_15532  PCLK_BIT(MDR_MIL_STD_15532_BASE)
    #define RST_CLK_PCLK_POWER          PCLK_BIT(MDR_POWER_BASE)
    #define RST_CLK_PCLK_WWDG           PCLK_BIT(MDR_WWDG_BASE)
    #define RST_CLK_PCLK_IWDG           PCLK_BIT(MDR_IWDG_BASE)
    #define RST_CLK_PCLK_TIMER1         PCLK_BIT(MDR_TIMER1_BASE)
    #define RST_CLK_PCLK_TIMER2         PCLK_BIT(MDR_TIMER2_BASE)
    #define RST_CLK_PCLK_TIMER3         PCLK_BIT(MDR_TIMER3_BASE)
    #define RST_CLK_PCLK_ADC            PCLK_BIT(MDR_ADC_BASE)
    #define RST_CLK_PCLK_DAC            PCLK_BIT(MDR_DAC_BASE)
    #define RST_CLK_PCLK_TIMER4         PCLK_BIT(MDR_TIMER4_BASE)
    #define RST_CLK_PCLK_SSP2           PCLK_BIT(MDR_SSP2_BASE)
    #define RST_CLK_PCLK_PORTA          PCLK_BIT(MDR_PORTA_BASE)
    #define RST_CLK_PCLK_PORTB          PCLK_BIT(MDR_PORTB_BASE)
    #define RST_CLK_PCLK_PORTC          PCLK_BIT(MDR_PORTC_BASE)
    #define RST_CLK_PCLK_PORTD          PCLK_BIT(MDR_PORTD_BASE)
    #define RST_CLK_PCLK_PORTE          PCLK_BIT(MDR_PORTE_BASE)
    #define RST_CLK_PCLK_ARINC429R      PCLK_BIT(MDR_ARINC429R_BASE)
    #define RST_CLK_PCLK_BKP            PCLK_BIT(MDR_BKP_BASE)
    #define RST_CLK_PCLK_ARINC429T      PCLK_BIT(MDR_ARINC429T_BASE)
    #define RST_CLK_PCLK_PORTF          PCLK_BIT(MDR_PORTF_BASE)
    #define RST_CLK_PCLK_EBC            PCLK_BIT(MDR_EBC_BASE)
    #define RST_CLK_PCLK_SSP3           PCLK_BIT(MDR_SSP3_BASE)


    #define IS_RST_CLK_PCLK(PCLK)       ((PCLK) >= 0x00 && (PCLK) <= 0xFFFFFFFF)
#endif /* #if defined (USE_MDR32F1QI) */

/** @} */ /* End of group CLK_peripheral */

#define IS_RCC_CLK_HSI_TRIM_VALUE(TRIM)       ((TRIM) <= 0x3F)
#define IS_RCC_CLK_LSI_TRIM_VALUE(TRIM)       ((TRIM) <= 0x1F)

/** @} */ /* End of group RST_CLK_Exported_Constants */


/** @defgroup RST_CLK_Exported_Functions RST_CLK Exported Functions
  * @{
  */

void RST_CLK_DeInit(void);
void RST_CLK_WarmDeInit(void);

void RST_CLK_HSEconfig(RST_CLK_HSE_Mode RST_CLK_HSE);
ErrorStatus RST_CLK_HSEstatus(void);
#if defined (USE_MDR32F1QI)
    void RST_CLK_HSE2config(RST_CLK_HSE2_Mode RST_CLK_HSE2);
    ErrorStatus RST_CLK_HSE2status(void);
#endif /* #if defined (USE_MDR32F1QI) */

void RST_CLK_LSEconfig(RST_CLK_LSE_Mode RST_CLK_LSE);
ErrorStatus RST_CLK_LSEstatus(void);

void RST_CLK_HSIcmd(FunctionalState NewState);
void RST_CLK_HSIadjust(uint32_t HSItrimValue);
ErrorStatus RST_CLK_HSIstatus(void);

void RST_CLK_LSIcmd(FunctionalState NewState);
void RST_CLK_LSIadjust(uint32_t LSItrimValue);
ErrorStatus RST_CLK_LSIstatus(void);

void RST_CLK_CPU_PLLconfig(RST_CLK_CPU_PLL_Source RST_CLK_CPU_PLLsource, uint32_t RST_CLK_CPU_PLLmul);
void RST_CLK_CPU_PLLuse(FunctionalState UsePLL);
void RST_CLK_CPU_PLLcmd(FunctionalState NewState);
ErrorStatus RST_CLK_CPU_PLLstatus(void);

void RST_CLK_CPUclkPrescaler(RST_CLK_CPU_C3_Divisor CPUclkDivValue);
void RST_CLK_CPUclkSelection(RST_CLK_HCLK_Source CPU_CLK);

void RST_CLK_USB_PLLconfig(RST_CLK_USB_PLL_Source RST_CLK_USB_PLLsource, uint32_t RST_CLK_USB_PLLmul);
void RST_CLK_USB_PLLuse(FunctionalState UsePLL);
void RST_CLK_USB_PLLcmd(FunctionalState NewState);
ErrorStatus RST_CLK_USB_PLLstatus(void);

void RST_CLK_USBclkPrescaler(FunctionalState NewState);
void RST_CLK_USBclkEnable(FunctionalState NewState);

void RST_CLK_ADCclkSelection(RST_CLK_ADC_Source ADC_CLK);
void RST_CLK_ADCclkPrescaler(RST_CLK_ADC_C3_Divisor ADCclkDivValue);
void RST_CLK_ADCclkEnable(FunctionalState NewState);

void RST_CLK_HSIclkPrescaler(RST_CLK_HSI_C1_Divisor HSIclkDivValue);
void RST_CLK_RTC_HSIclkEnable(FunctionalState NewState);

void RST_CLK_HSEclkPrescaler(RST_CLK_HSE_C1_Divisor HSEclkDivValue);
void RST_CLK_RTC_HSEclkEnable(FunctionalState NewState);

void RST_CLK_CPUclkSelectionC1(RST_CLK_CPU_C1_Source CPU_CLK);

void RST_CLK_PCLKcmd(uint32_t RST_CLK_PCLK, FunctionalState NewState);

#if defined (USE_MDR32FG16S1QI)
    void RST_CLK_AUCclkDeInit(void);
    void RST_CLK_AUCclkSelection(RST_CLK_AUC_Source AUC_CLK);
    void RST_CLK_AUCclkPrescaler(RST_CLK_AUC_C3_Divisor AUCclkDIVValue);
    void RST_CLK_AUCclkCMD(FunctionalState NewState);
#endif /* #if defined (USE_MDR32FG16S1QI) */

void RST_CLK_GetClocksFreq(RST_CLK_FreqTypeDef* RST_CLK_Clocks);

FlagStatus RST_CLK_GetFlagStatus(RST_CLK_Flags RST_CLK_FLAG);

#if defined (USE_MDR32FG16S1QI)
    void RST_CLK_DSP_Selection(RST_CLK_DSP_C1_Source DSP_CLK_Source);
    void RST_CLK_DSPPLLConfig(RST_CLK_DSP_PLL_Multiplier PLLMul);
    void RST_CLK_DSPPLL_CMD(FunctionalState NewState);
    ErrorStatus RST_CLK_DSP_PLLStatus(void);
    void RST_CLK_DSP_PLLUse(FunctionalState UsePLL);
    void RST_CLK_DSPPrescaler(RST_CLK_DSP_C3_Divisor DSP_Prescaler);
    void RST_CLK_DSPCmd(FunctionalState NewState);
#endif /* #if defined (USE_MDR32FG16S1QI) */

/** @} */ /* End of group RST_CLK_Exported_Functions */

/** @} */ /* End of group RST_CLK */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* __MDR32FxQI_RST_CLK_H */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_rst_clk.h */


